##################################################################################
ACL TEST ON ADD as 'ADMINISTRATOR': Add new entry under ou=eng,dc=vmware,dc=com as 'administrator'
##################################################################################

adding new entry "cn=John-add,ou=eng,dc=vmware,dc=com"

# extended LDIF
#
# LDAPv3
# base <dc=com> with scope subtree
# filter: (cn=john-add)
# requesting: dn 
#

# John-add, eng, vmware.com
dn: cn=John-add,ou=eng,dc=vmware,dc=com

# search result
search: 2
result: 0 Success

# numResponses: 2
# numEntries: 1
#####################################################################################
ACL TEST ON DELETE as 'ADMINISTRATOR': Delete entry under ou=eng,dc=vmware,dc=com as 'administrator'
#####################################################################################

deleting entry "cn=John-add,ou=eng,dc=vmware,dc=com"

# extended LDIF
#
# LDAPv3
# base <dc=com> with scope subtree
# filter: (cn=john-add)
# requesting: dn 
#

# search result
search: 2
result: 0 Success

# numResponses: 1
Add the entry back to do DELETE test

adding new entry "cn=John-add,ou=eng,dc=vmware,dc=com"

# extended LDIF
#
# LDAPv3
# base <dc=com> with scope subtree
# filter: (cn=john-add)
# requesting: dn 
#

# John-add, eng, vmware.com
dn: cn=John-add,ou=eng,dc=vmware,dc=com

# search result
search: 2
result: 0 Success

# numResponses: 2
# numEntries: 1
#####################################################################################
ACL TEST ON DELETE as 'John-1': Delete entry under ou=eng,dc=vmware,dc=com as 'John-1'
#####################################################################################

ldap_delete: Insufficient access (50)
	additional info: VmDirSrvAccessCheck failed - (9207)(Insufficient access, access denied)
deleting entry "cn=John-add,ou=eng,dc=vmware,dc=com"

# extended LDIF
#
# LDAPv3
# base <dc=com> with scope subtree
# filter: (cn=john-add)
# requesting: dn 
#

# John-add, eng, vmware.com
dn: cn=John-add,ou=eng,dc=vmware,dc=com

# search result
search: 2
result: 0 Success

# numResponses: 2
# numEntries: 1
#####################################################################################
ACL TEST ON DELETE as 'Administrator': Delete entry under ou=eng,dc=vmware,dc=com as 'Administrator'
#####################################################################################

deleting entry "cn=John-add,ou=eng,dc=vmware,dc=com"

###################################################################################
ACL TEST ON ADD as 'John-1': Add new entry under ou=eng,dc=vmware,dc=com as 'John-1'
###################################################################################

ldap_add: Insufficient access (50)
adding new entry "cn=John-add,ou=eng,dc=vmware,dc=com"

######################################################################
Add an attribute value (displayName: david) to an existing indexed attribute.
######################################################################

Bind as administrator to modify John-2
modifying entry "cn=John-2,ou=eng,dc=vmware,dc=com"

# extended LDIF
#
# LDAPv3
# base <cn=John-2,ou=eng,dc=vmware,dc=com> with scope baseObject
# filter: objectclass=*
# requesting: displayName 
#

# John-2, eng, vmware.com
dn: cn=John-2,ou=eng,dc=vmware,dc=com
displayName: wfu

# search result
search: 2
result: 0 Success

# numResponses: 2
# numEntries: 1
Bind as John-2 to modify John-2
modifying entry "cn=John-2,ou=eng,dc=vmware,dc=com"

# extended LDIF
#
# LDAPv3
# base <cn=John-2,ou=eng,dc=vmware,dc=com> with scope baseObject
# filter: objectclass=*
# requesting: displayName 
#

# John-2, eng, vmware.com
dn: cn=John-2,ou=eng,dc=vmware,dc=com

# search result
search: 2
result: 0 Success

# numResponses: 2
# numEntries: 1
Bind as John-1 to modify John-2
ldap_modify: Insufficient access (50)
	additional info: VmDirSrvAccessCheck failed - (9207)
modifying entry "cn=John-2,ou=eng,dc=vmware,dc=com"


Bind Anonymously to search for 'cn=schemacontext'
Anonymous search on 'cn=schemacontext' subtree should NOT be allowed
# extended LDIF
#
# LDAPv3
# base <cn=schemacontext> with scope subtree
# filter: (objectClass=*)
# requesting: dn 
#

# search result
search: 2
result: 50 Insufficient access
text: Not bind/authenticate yet

# numResponses: 1

Bind as John-1 to search for 'cn=schemacontext'
A normal user should also have access right to 'cn=schemacontext' search
# extended LDIF
#
# LDAPv3
# base <cn=schemacontext> with scope subtree
# filter: (objectClass=*)
# requesting: dn 
#

# schemacontext
dn: cn=schemacontext

# aggregate, schemacontext
dn: cn=aggregate,cn=schemacontext

# search result
search: 2
result: 0 Success

# numResponses: 3
# numEntries: 2

Bind as John-1 to search for 'dc=vmware,dc=com'
A normal user should not have access right to 'dc=vmware,dc=com' (administrator/administrators have)
# extended LDIF
#
# LDAPv3
# base <dc=vmware,dc=com> with scope baseObject
# filter: (objectClass=*)
# requesting: dn 
#

# search result
search: 2
result: 0 Success

# numResponses: 1
